{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "ai4bharat/indictrans2-indic-en-dist-200M",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "k_proj",
    "fc1",
    "out_proj",
    "fc2",
    "v_proj"
  ],
  "task_type": "SEQ_2_SEQ_LM",
  "use_dora": false,
  "use_rslora": false
}